var featuresConfig = {
  selectionConfig: {
    showAttributeBox: false,
    enableHover: false,
    defaultIconPath: "./assets/fleur.png",
    selectionColor: null,
    HoverColor: 0x0061ff
  },
  cameraFeatureConfig: {
    path:[{
        ctrlPoint: {
          name: "1.总场景远视角",//当前点名称
          x: -2049.9929021170024,
          y: 3110.9963373510304,
          z: 4024.8508703838324
        },
        focalPoint: {
          x: 0.40217697164718846,
          y: -0.5756430243851173,
          z: -0.7119612292487929
        },
        sectionTime: 5,//过渡时间
        stopTime: 0 //停留时间
      },
      {
        ctrlPoint: {
          name: "2.贴近东方明珠",
          x: -1113.6417937436813, y: 867.8214980163516, z: -135.16450080873838
        },
        focalPoint: {
          x: 0.8777425495580219, y: -0.4788940042079029, z: -0.015117851338889567
        },
        sectionTime: 5,
        stopTime: 0,
      },
      {
        ctrlPoint: {
          name: "3.河面 logo 上方",
          x: 487.3260458195556, y: 919.4157013232862, z: 2409.2656473438456
        },
        focalPoint: {
          x: 0.12855458058020433, y: -0.46113819938538947, z: -0.8779665602284912
        },
        sectionTime: 5,
        stopTime: 0
      },
      {
        ctrlPoint: {
          name: "4.道路施工1",
          x: 2461.8984194156583, y: 253.13088549843445, z: 2362.2164830307843
        },
        focalPoint: {
          x: -0.6509764062078783, y: -0.096903675833687, z: -0.7528873728324806
        },
        sectionTime: 8,
        stopTime: 0
      },
      {
        ctrlPoint: {
          name: "5.公共自行车存放点1",
          x: 2975.5686856824377, y: 507.7596031426158, z: 997.325959563434
          },
          focalPoint: {
          x: -0.7618265568356328, y: -0.25513890097887076, z: -0.5954195483079626
          },
          sectionTime: 5,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "6.桥尾",
          x: 2900.1657406177796, y: 549.3407268277588, z: -782.9169072700497
          },
          focalPoint: {
          x: -0.8882055631876703, y: -0.280978871147914, z: -0.3635130692161118
          },
          sectionTime: 3,
          stopTime: 0
          }, {
          ctrlPoint: {
          name: "7.人口密集点1",
          x: 2064.255371109519, y: 447.30360199343147, z: -2847.576474098276
          },
          focalPoint: {
          x: -0.3237581977604585, y: -0.19635640088007025, z: 0.9255402709857226
          },
          sectionTime: 4,
          stopTime: 0
          }, {
          ctrlPoint: {
          name: "8.人口密集点2 镜头拉远",
          x: 2146.470091698687, y: 1505.2974366923183, z: -3480.596749068798
          },
          focalPoint: {
          x: -0.415754832395006, y: -0.44919687616812753, z: 0.790803443202542
          },
          sectionTime: 5,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "9.道路施工2",
          x: 224.56432190236774, y: 541.5347644636124, z: -3420.837738610361
          },
          focalPoint: {
          x: 0.28471872237166823, y: -0.18318893832026267, z: 0.9409447709659371
          },
          sectionTime: 5,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "10.油罐车翻车",
          x: -3121.379350602593, y: 906.3767174974348, z: -2012.7397179531727
          },
          focalPoint: {
          x: 0.7164677267552769, y: -0.43113408066349845, z: 0.5484499986403191
          },
          sectionTime: 3,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "11.油罐车翻车-近景",
          x: -2574.6239250178205, y: 124.04053969414376, z: -1427.8807653187318
          },
          focalPoint: {
         x: 0.7815773109049737, y: -0.17659270316511713, z: 0.598290835854425
          },
          sectionTime: 3,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "12.城市监测中心2/道路施工2",
          x: -3121.379350602593, y: 906.3767174974348, z: -2012.7397179531727
          },
          focalPoint: {
          x: 0.7164677267552769, y: -0.43113408066349845, z: 0.5484499986403191
          },
          sectionTime: 5,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "13.火灾事故-近景",
          x: -1946.3329713910557, y: 223.157709762799, z: -195.04320506441385
          },
          focalPoint: {
          x: 0.866574349774281, y: -0.2680829947364633, z: 0.42092802739472174
          },
          sectionTime: 6,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "14.火灾事故-远景",
          x: -1803.3440603478543, y: 729.7983945475394, z: 1439.8661916789729
          },
          focalPoint: {
          x: 0.44359397406284806, y: -0.5080528385701641, z: -0.7383134154245935
          },
          sectionTime: 5,
          stopTime: 0
          },
          {
          ctrlPoint: {
          name: "15.总场景远视角",
          x: -2049.9929021170024,
          y: 3110.9963373510304,
          z: 4024.8508703838324
          },
          focalPoint: {
          x: 0.40217697164718846,
          y: -0.5756430243851173,
          z: -0.7119612292487929
          },
          sectionTime: 8,//过渡时间
          stopTime: 5 //停留时间
      },
      {
        ctrlPoint: {
          name: "1.总场景远视角",//当前点名称
          x: -2049.9929021170024,
          y: 3110.9963373510304,
          z: 4024.8508703838324
        },
        focalPoint: {
          x: 0.40217697164718846,
          y: -0.5756430243851173,
          z: -0.7119612292487929
        },
        sectionTime: 5,//过渡时间
        stopTime: 0 //停留时间
      },
    ]
  }
};
